hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stdio.h"
#include "string.h"
#include "serial.h"
#include "led_btn_joy.h"
#include "tHSEMBody_cif.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

// タイマの OnePulse モードを使用する
// どうしても割込みが入ってくれないようなので、あきらめる
// #define OnePulseF401

// Disable & Enable Update Interrupt
#define __HAL_TIM_UDIS_DISABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1|=TIM_CR1_UDIS)
#define __HAL_TIM_UDIS_ENABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1&=~TIM_CR1_UDIS)

#define TIM_CLK  TIM5
#define TIM_CLK_IRQNO  TIM5_IRQn
#define TIM_CLK_IRQHandler  TIM5_IRQHandler
#define COUNT_BASE 1000
uint32_t  tim_clk_count;

#ifndef HSEM_ID_0
#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#endif
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

extern TIM_HandleTypeDef Tim2Handle;
extern TIM_HandleTypeDef Tim5Handle;
#define htim2 Tim2Handle
#define htim_clk Tim5Handle

UART_HandleTypeDef huart1;
void MPU_Config(void);

/*---------------------------------------*/
int   b_sta_ker;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/*---------------------------------------------*/
#include "com_var.h"
#include "stm32h747xx.h"
#include "stm32h7xx_hal_gpio.h"

// #define LED_ENABLE     /* Cortex-M4 コアで使用する場合は、外す */

/* LED 番号 LED1～LED4 */
typedef enum  {
    LED1 = 0, LED2, LED3, LED4
} LED_Index;

/* LED 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} LED_conf;

/* LED1～LED4 の構成 */
const LED_conf led_conf[] =
{
    { GPIOI, GPIO_PIN_12 },      /* LED1 */
    { GPIOI, GPIO_PIN_13 },      /* LED2 */
    { GPIOI, GPIO_PIN_14 },      /* LED3 */
    { GPIOI, GPIO_PIN_15 },      /* LED4 */
};

/* LED の初期化 */
void led_init()
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOIEN;
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_OUTPUT_OD;
    gpio_init.Pull      = GPIO_NOPULL;
    gpio_init.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Alternate = 0x0;
    for( i = LED1; i <= LED4; i++ ){
        gpio_init.Pin   = led_conf[ i ].Pin;
        HAL_GPIO_Init( led_conf[ i ].gpio, &gpio_init );
    }
}

void led_on( uint32_t no )
{
#ifdef LED_ENABLE
    if( no <= LED4 )
        HAL_GPIO_WritePin( led_conf[no].gpio, led_conf[no].Pin, GPIO_PIN_RESET );
#endif /* LED_ENABLE */
}

void led_off( uint32_t no )
{
#ifdef LED_ENABLE
    if( no <= LED4 )
        HAL_GPIO_WritePin( led_conf[no].gpio, led_conf[no].Pin, GPIO_PIN_SET );
#endif /* LED_ENABLE */
}

void led_set( int val )
{
#ifdef LED_ENABLE
    /* 4回繰り返し書くので効率悪い。製品ではお勧めしないコーディング */
    /* LED が同じ GPIO で並んでいることを利用して、１回の IO アクセスでよいように効率化したバージョン */
    uint32_t rs_val = 0;
    int i;
    for( i = LED1; i <= LED4; i++ ){
      if( val & ( 1 << i ) )
        rs_val |= 1 << (i+12+16);
      else
        rs_val |= 1 << (i+12);
    }
    /* GPIO のレジスタに直接書き込む */
    led_conf[0].gpio->BSRR = rs_val;
#endif /* LED_ENABLE */
}

void
led_blink( int i, int j )
{
  int  n;
  while(1){
    for( n = 0; n < 100000; n++ ){
      led_set(i);
    }
    for( n = 0; n < 100000; n++ ){
      led_set(j);
    }
  }

}

/*--------------------------- Joy Stick --------------------------*/

/* Joystick 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} Joy_conf;

/* JOY_SEL～JOY_UP の構成 */
const Joy_conf joy_conf[] =
{
    { GPIOK, GPIO_PIN_2 },      /* JOY_SEL */
    { GPIOK, GPIO_PIN_3 },      /* JOY_DOWN */
    { GPIOK, GPIO_PIN_4 },      /* JOY_LEFT */
    { GPIOK, GPIO_PIN_5 },      /* JOY_RIGHT */
    { GPIOK, GPIO_PIN_6 },      /* JOY_UP */
};


/* joystick の初期化 */
void joy_init(void)
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOKEN;    /* GPIO PK2..5 に接続される */
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_INPUT;
    gpio_init.Pull      = GPIO_PULLUP;        /* SWを押すと GND になる */
    gpio_init.Speed     = GPIO_SPEED_FREQ_LOW;
    gpio_init.Alternate = 0x0;
    for( i = JOY_SEL; i <= JOY_UP; i++ ){
        gpio_init.Pin   = joy_conf[ i ].Pin;
        HAL_GPIO_Init( joy_conf[ i ].gpio, &gpio_init );
    }
}

int joy_stat(void)
{
    int  val = 0;
    int  i;

    /* 5回繰り返し読むので効率悪い。製品ではお勧めしないコーディング */
    for( i = JOY_SEL; i <= JOY_UP; i++ ){
      val |= ((int)HAL_GPIO_ReadPin( joy_conf[ i ].gpio, joy_conf[ i ].Pin ) ? 0:1) << i;
    }
    return val;
}

/*--------------------------- Button --------------------------*/
/* Joystick 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} Btn_conf;

/* Button の構成 */
const Btn_conf btn_conf[] =
{
    { GPIOC, GPIO_PIN_13 },      /* Button */
};


/* Button の初期化 */
void btn_init(void)
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOCEN;    /* GPIO PK2..5 に接続される */
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_INPUT;
    gpio_init.Pull      = GPIO_NOPULL;        /* 外部で Pull Down されている */
    gpio_init.Speed     = GPIO_SPEED_FREQ_LOW;
    gpio_init.Alternate = 0x0;
    for( i = 0; i < 1; i++ ){
        gpio_init.Pin   = btn_conf[ i ].Pin;
        HAL_GPIO_Init( btn_conf[ i ].gpio, &gpio_init );
    }
}

